<?php
//역슬래쉬엔(\n)은 행을 바꿔준다.

    // print "안녕하세요.\n";
    // print ("안녕하세요. 괄호입니다.\n");

// 현업에서 많이 사용 

    // echo "안녕하세요. 에코입니다.\n";


//변수는 세팅하고자 하는 값을 넣어준다.
//변수만들때 주의사항
//1. 젤앞에 숫자가 오면 안된다.
//2. 특수문자가 들어가면 안된다.
//3. 영어 대문자 소문자 언더바 숫자만 쓸수있다.

    // $test_num = "변수변수";

//네이밍 기법
    // 1. 카멜 기법 : 낙타의 등을 연상하고, 단어의 첫글자는 대문자, 나머지는 소문자로 작성 하는 기법
    //     예) $test_num
    // 2. 스네이크 기법 : 뱀을 연상하고, 단어와 단어 사이를"_"(언더바)로 이어주고 전부 소문자로 작성하는 기법
    //     예) $test_num


    // echo "점심메뉴\n탕수육 8,000\n짜장면 6,000\n짬뽕 6,000"

    // echo "점심메뉴\n";
    // echo "탕수육 8,000\n";
    // echo "짜장면 6,000\n";
    // echo "짬뽕 6,000";

    // $tang = "탕수육 8,000";
    // $zza = "짜장면 6,000";
    // $zzam = "짬뽕 6,000";

    // echo "점심메뉴\n";
    // echo $tang;
    // echo $zza;
    // echo $zzam;
?>