<?php
    // 1. 산술연산자

    // echo "더하기 : 1 + 1 = ",1 + 1;
    // echo "\n빼기 : 1 - 1 = ", 1-1;
    // echo "\n곱하기 : 2 * 3 = ", 2 * 3;
    // echo "\n나누기 : 10 / 2 = ", 10 / 2;
    // echo "\n나머지 : 9 % 7 = ", 9 % 7;
    // echo "\n연산순서 : 10 - 5 * 8 = ", 10 - 5 * 8;
    // echo "\n\n";
    // // 2. 증가/감소 연산자
    // $num1 = 1;
    // $num2 = 1;

    // // 전워증가연산자
    // ++$num;
    // $num1 = $num +1;

    // // 후위증가연산자
    // $num++;

    // echo $num1++, "\n";
    // echo $num1;

    // // 3. 산술 대입 연산자

    // $num1 = 1;
    // $num1 = $num + 1;
    
    // $num2 = 1;
    // $num2 += 1;
    
    // $num2 -= 1;
    
    // $num2 /= 1;
    
    // $num2 *= 1;
    
    // $num2 %= 1;
    
    // //산술대입 연산자를 이용해서 계산해주세요.
    // $tng_num = 10;

    // // $tng_num에 10을 더해주세요.
    // // $tng_num에 5로 나누어주세요.
    // // $tng_num에 4를 빼주세요.
    // // $tng_num에 7로 나눈 나머지를 구해주세요.
    // // $tng_num에 3을 곱해주세요.

    // echo $tng_num += 10,"\n";
    // echo $tng_num /= 5,"\n";
    // echo $tng_num -= 4,"\n";
    // echo $tng_num %= 7,"\n";
    // echo $tng_num *= 3,"\n";

    // //산술대입 연산자를 이용해서 계산해주세요.
    // $tng_num = 10;

    // echo $tng_num + 10,"\n";
    // echo $tng_num / 5,"\n";
    // echo $tng_num - 4,"\n";
    // echo $tng_num % 7,"\n";
    // echo $tng_num * 3;


    // 4. 비교 연산자
    // $t1 = 1;
    // $t2 = '1';
    // var_dump(1 > 2);
    // var_dump(1 < 2);
    // var_dump(1 >= 1);
    // var_dump(1 <= 1);
    // var_dump($t1 == $t2);
    // var_dump($t1 === $t2);
    // var_dump($t1 != $t2);
    // var_dump($t1 !== $t2);

    // 5. 논리 연산자
    // (and 논리 연산자) && 논리 연산자는 둘다 참일때만 참으로 나온다
    // var_dump( 1 == 2 && 2 == 3 );
    // (or 논리 연산자)|| 논리 연산 둘중 하나만 참이여도 참이 나온다
    // var_dump( 1 == 2 || 2 == 2 );
    // (not 논리 연산자) ! 논리 연산자는 결과를 반대로 뒤집는 연산자이다.
    // 결과를 반대로 뒤집는 연산자이다.
    // var_dump( !(1 == 1) );

?>